app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'cederik_1100'
 LIMIT 1
INSERT INTO `login_history` (`user_id`, `login_time`, `ip_address`) VALUES ('24', '2024-11-08 16:23:18', '180.190.214.6')
---
    public function login()
    {
        $session = session();
        if ($session->get('isLoggedIn')) {
            return redirect()->to('tasks');
        }

        // Set timezone to Manila
        date_default_timezone_set('Asia/Manila');

        $session = session();
        $model = new Users();
        $loginHistoryModel = new LoginHistoryModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();

        if ($data) {
            $pass = $data['password'];
            $authenticatePassword = password_verify($password, $pass);
            if ($authenticatePassword) {
                // Log login history
                $ipAddress = file_get_contents('https://api.ipify.org'); // Get user's IP address
                $loginHistoryModel->insert([
                    'user_id' => $data['id'],
                    'login_time' => date('Y-m-d H:i:s'), // Current date and time in Manila time
                    'ip_address' => $ipAddress
                ]);

UPDATE `login_history` SET `logout_time` = '2024-11-08 16:23:25'
WHERE `user_id` = '24'
AND `logout_time` IS NULL
---
    public function logout()
    {
        // Set timezone to Manila
        date_default_timezone_set('Asia/Manila');

        $session = session();
        $loginHistoryModel = new LoginHistoryModel();

        $userId = $session->get('id');

        if ($userId) {
            // Update logout time for the current user
            $loginHistoryModel->set('logout_time', date('Y-m-d H:i:s'))
                ->where('user_id', $userId)
                ->where('logout_time', null) // Ensure it updates the correct record
                ->update();

SELECT *
FROM `users`
WHERE `email` = 'valenteros.c.bscs@gmail.com'
 LIMIT 1
---
    public function emailForgotPassword()
    {
        // Load helper and library for form and session handling
        helper(['form', 'url']);
        $session = session();

        // Retrieve and validate the email input
        $email = $this->request->getPost('email');
        if (filter_var($email, FILTER_VALIDATE_EMAIL)) {
            // Check if the email exists in the database
            $userModel = new Users();
            $user = $userModel->where('email', $email)->first();

INSERT INTO `user_sessions` (`user_id`, `token`, `ip_address`, `user_agent`, `created_at`, `expires_at`) VALUES ('24', '0be656974f69bf9418fce2cd154850a053b6d69cdd9085168be5485d80f134e9e91b1d249ad3b8edb3526268d4fe9a0ba4f5', '180.190.214.6', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.0.0 Safari/537.36', '2024-11-08 08:15:27', '2024-11-08 09:15:27')
---
                    'expires_at' => $expiresAt
                ];

                if ($profileModel->insert($sessionData)) {