app/Controllers/LoginHistory.php

    public function showLoginHistory()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/')->with('error', 'You must be logged in to access this page.');
        }
        // Assuming you store the user ID in session after logging in
        $userId = session()->get('id');

        // Initialize the login history model
        $loginHistoryModel = new LoginHistoryModel();

        // Fetch only the login history for the logged-in user
        $data['logins'] = $loginHistoryModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `login_history`
WHERE `user_id` = '24'