app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '24'
---
    public function index($id)
    {
        $userModel = new Users();

        // Fetch user data by ID
        $user = $userModel->find($id);