app/Controllers/Settings.php

    public function index()
    {
        $model = new Users();
        $userId = session()->get('id');
        $data['user'] = $model->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '24'