app/Controllers/TaskController.php

    public function index()
    {
        $taskModel = new Task();

        // Get the current logged-in user's ID from the session
        $userId = session()->get('id');

        // Retrieve tasks for the logged-in user
        $data['tasks'] = $taskModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `tasks`
WHERE `user_id` = '24'